In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
df = pd.DataFrame(randn(4,3), ['a','b','c','d'], ['X','Y','Z'])

In [5]:
df

          X         Y         Z
a -0.886273  0.339214 -1.374090
b  0.107283 -0.850110 -0.814488
c -0.207169  1.185572 -0.971914
d -0.618391 -0.947561  0.711593

In [6]:
df > 0

       X      Y      Z
a  False   True  False
b   True  False  False
c  False   True  False
d  False  False   True

In [7]:
bool_df = df > 0

In [8]:
df[bool_df]

          X         Y         Z
a       NaN  0.339214       NaN
b  0.107283       NaN       NaN
c       NaN  1.185572       NaN
d       NaN       NaN  0.711593

In [9]:
df[df > 0]

          X         Y         Z
a       NaN  0.339214       NaN
b  0.107283       NaN       NaN
c       NaN  1.185572       NaN
d       NaN       NaN  0.711593

In [10]:
df['Y']>1

a    False
b    False
c     True
d    False
Name: Y, dtype: bool

In [11]:
type(df['Y'])

pandas.core.series.Series

In [12]:
df[df['Y']>0]

          X         Y         Z
a -0.886273  0.339214 -1.374090
c -0.207169  1.185572 -0.971914

In [13]:
df[df['Y']<0]

          X         Y         Z
b  0.107283 -0.850110 -0.814488
d -0.618391 -0.947561  0.711593

In [14]:
res_df = df[df['X']<0]

In [15]:
res_df

          X         Y         Z
a -0.886273  0.339214 -1.374090
c -0.207169  1.185572 -0.971914
d -0.618391 -0.947561  0.711593

In [16]:
res_df['Z']

a   -1.374090
c   -0.971914
d    0.711593
Name: Z, dtype: float64

In [17]:
df[df['X']<0]['Z']

a   -1.374090
c   -0.971914
d    0.711593
Name: Z, dtype: float64

In [18]:
df[df['X']<0][['Z','X']]

          Z         X
a -1.374090 -0.886273
c -0.971914 -0.207169
d  0.711593 -0.618391

In [24]:
df[(df['X']>0) & (df['Z']<0)]

          X        Y         Z
b  0.107283 -0.85011 -0.814488

In [25]:
df[(df['X']>0) | (df['Z']<0)]

          X         Y         Z
a -0.886273  0.339214 -1.374090
b  0.107283 -0.850110 -0.814488
c -0.207169  1.185572 -0.971914

In [26]:
df.reset_index

<bound method DataFrame.reset_index of           X         Y         Z
a -0.886273  0.339214 -1.374090
b  0.107283 -0.850110 -0.814488
c -0.207169  1.185572 -0.971914
d -0.618391 -0.947561  0.711593>

In [27]:
df

          X         Y         Z
a -0.886273  0.339214 -1.374090
b  0.107283 -0.850110 -0.814488
c -0.207169  1.185572 -0.971914
d -0.618391 -0.947561  0.711593

In [28]:
z1 = [2, 3, 5, 6]

In [34]:
df['Z1'] = z1

In [35]:
df

           X         Y         Z  Z1
z1
2  -0.886273  0.339214 -1.374090   2
3   0.107283 -0.850110 -0.814488   3
5  -0.207169  1.185572 -0.971914   5
6  -0.618391 -0.947561  0.711593   6

In [37]:
df.set_index('Z1', inplace=True)

KeyError: "None of ['Z1'] are in the columns"

In [38]:
df

           X         Y         Z
Z1
2  -0.886273  0.339214 -1.374090
3   0.107283 -0.850110 -0.814488
5  -0.207169  1.185572 -0.971914
6  -0.618391 -0.947561  0.711593